{
  "wiki_Smoker's Lung": "Chronic obstructive pulmonary disease (COPD) is a type of progressive lung disease characterized by chronic respiratory symptoms and airflow limitation. GOLD defines COPD as a heterogeneous lung condition characterized by chronic respiratory symptoms (shortness of breath, cough, sputum production or exacerbations) due to abnormalities of the airways (bronchitis, bronchiolitis) or alveoli (emphysema) that cause persistent, often progressive, airflow obstruction.\nThe main symptoms of COPD include shortness of breath and a cough, which may or may not produce mucus.",
  "pubmed_Smoker's Lung": "  • <b>CYP1A1 and GSTM1 genotypes affect benzo[a]pyrene DNA adducts in smokers' lung: comparison with aromatic/hydrophobic adduct formation.</b><br>    <i>Benzo[a]pyrene diol epoxide (BPDE)-DNA adducts are involved in the induction of p53 mutations and probably in the causation of human lung cancer associated with cigarette smoking. The ratio between CY...</i><br><br>  • <b>Smoking-related O4-ethylthymidine formation in human lung tissue and comparisons with bulky DNA adducts.</b><br>    <i>Tobacco smoke contains many alkylating agents that can react with DNA to produce O(4)-ethylthymidine (O(4)-etT) and several other types of promutagenic base modifications. Our aims were (i) to confirm...</i>",
  "wiki_Pepper (Bell) - Healthy": "The Florina pepper (Greek: πιπεριά Φλωρίνης) is a pepper cultivated in the northern Greek region of Western Macedonia, specifically in the wider area of Florina, for which it is named. It boasts a deep red color and is shaped like a cow's horn. Initially, the pepper has a green hue, ripening into red, after the 15th of August.",
  "pubmed_Pepper (Bell) - Healthy": "No recent research articles were found on PubMed for this topic.",
  "wiki_Lumpy Skin Disease": "Lumpy skin disease (LSD) is an infectious disease in cattle caused by Lumpy skin disease virus of the family Poxviridae, also known as Neethling virus. The disease is characterized by fever, enlarged superficial lymph nodes, and multiple nodules (measuring 2–5 centimetres (1–2 in) in diameter) on the skin and mucous membranes, including those of the respiratory and gastrointestinal tracts. Infected cattle may also develop edematous swelling in their limbs and exhibit lameness.",
  "pubmed_Lumpy Skin Disease": "  • <b>Lumpy Skin Disease.</b><br>    <i>Lumpy skin disease (LSD) is a contagious non-zoonotic viral disease of cattle. The disease raises great concern due to the recent rapid spread toward free countries and reoccurrence in countries where...</i><br><br>  • <b>Lumpy skin disease virus enters into host cells via dynamin-mediated endocytosis and macropinocytosis.</b><br>    <i>Lumpy skin disease virus (LSDV), a ruminant poxvirus of the Capripoxvirus genus, is the etiologic agent of an economically important cattle disease categorized as a notifiable disease by the World Org...</i>",
  "wiki_Potato Early Blight": "Phytophthora infestans is an oomycete or water mold, a fungus-like microorganism that causes the serious potato and tomato disease known as late blight or potato blight. Early blight, caused by Alternaria solani, is also often called \"potato blight\". Late blight was a major culprit in the 1840s European, the 1845–1852 Irish, and the 1846 Highland potato famines.",
  "pubmed_Potato Early Blight": "  • <b>Multifunctionality of AsCFEM6 and AsCFEM12 effectors from the potato early blight pathogen Alternaria solani.</b><br>    <i>Plant pathogens secrete fungal-specific common in several fungal extracellular membrane (CFEM) effectors to manipulate host immunity and contribute to their virulence. Little is known about effectors ...</i><br><br>  • <b>Detection of </b><br>    <i>Early blight (EB) disease, caused mainly by ...</i>"
}