{
    "domain": "plant",
    "name": "Tomato - Two-spotted Spider Mite",
    "description": "A common and highly destructive plant pest, not an insect but an arachnid (mite). These tiny pests feed by piercing plant cells and sucking out their contents, causing a characteristic stippling on leaves, which can lead to severe plant stress, defoliation, and reduced yield.",
    "image_url": "pests/plant/spider_mite/images/tomato_spider_mite.jpg",
    "symptoms": {
        "initial_infestation": "Begins as tiny, pale yellow or white dots (stippling) on the upper surface of leaves, often concentrated near the midrib and veins. The leaf may look dusty. Fine, silky webbing may be visible, especially on the undersides of leaves.",
        "advanced_infestation": "The stippling becomes widespread, causing entire leaves to turn yellow, bronze, or pale, dry out, and die, leading to defoliation. Webbing becomes dense and may cover entire leaves and growing tips. The tiny mites (yellowish-green with two dark spots) and their eggs can be seen on the undersides of leaves, often moving within the webbing."
    },
    "pest_details": "Caused by the Two-spotted Spider Mite (*Tetranychus urticae*), a tiny, eight-legged arachnid. They reproduce extremely rapidly, completing a life cycle in as little as 5-7 days in optimal conditions.",
    "risk_factors": "**Hot, dry, and dusty conditions** are ideal for spider mite outbreaks. Low humidity, drought-stressed plants, and the overuse of broad-spectrum insecticides (which kill off their natural predators like ladybugs and predatory mites) strongly favor their rapid multiplication.",
    "preventive_measures": "Maintain adequate plant hydration; spider mites thrive on stressed plants. Regularly spray plants with water, focusing on the undersides of leaves, to increase humidity and dislodge mites. Encourage natural predators. Inspect new plants thoroughly before introducing them to your garden.",
    "solution": "For mild infestations, a strong blast of water can be effective. Apply insecticidal soap or horticultural oil (like neem oil), ensuring **thorough coverage** of the entire plant, especially the undersides of leaves. Repeat applications every 5-7 days to control newly hatched mites. For severe cases, releasing predatory mites (*Phytoseiulus persimilis*) is an effective biological control, or specific chemical miticides can be used (rotate products to prevent resistance).",
    "report_made_by": "https://github.com/abhi-abhi86"
}